// Дано массив [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]
//   Знайти суму і кількість додатних (положительных) елементів.
//   Знайти мінімальний (найменший) елемент масива і його індекс.
//   Знайти максимальний (найбільший) елемент масива та його індекс
//   Визначити кількість від’ємних (отрицательных) елементів масива
//   Знайти кількість непарних додатних елементів
//   Знайти кількість парних додатних елементів
//   Знайти суму парних додатних елементів
//   Знайти суму непарних додатних елементів
//   Знайти добуток всіх додатних елементів
//   Змінити на 0 всі елементи масива окрім найбільшого

const array = [16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4, 47];

